app/controllers/brands_controller.rb

SELECT * FROM "brands"
---
  def index
    @brands = Brand.all

SELECT * FROM "brands" WHERE ("brands"."id" = 1)
---
  def show
    @brand = Brand.find(params[:id])

INSERT INTO "brands" ("name", "created_at", "updated_at", "description") VALUES('Borosil', '2009-09-25 21:44:39', '2009-09-25 21:44:39', '')
---
  def create
    @brand = Brand.new(params[:brand])

    respond_to do |format|
      if @brand.save