app/controllers/inventories_controller.rb

SELECT * FROM "inventories"
SELECT * FROM "vendors"
SELECT * FROM "product_lists"
---
  def index
    @inventories = Inventory.all
    @vendors = Vendor.all
    @product_list = ProductList.all

SELECT * FROM "inventories" WHERE ("inventories"."id" = 1)
SELECT * FROM "vendors"
SELECT * FROM "product_lists"
---
  def show
    @inventory = Inventory.find(params[:id])
    @vendors = Vendor.all
    @product_list = ProductList.all

SELECT * FROM "vendors"
SELECT * FROM "product_lists"
---
  def new
    @inventory = Inventory.new
    @vendors = Vendor.all
    @product_list = ProductList.all

INSERT INTO "inventories" ("price", "created_at", "quantity", "updated_at", "product_list_id", "vendor_id") VALUES(400.0, '2009-09-25 23:03:40', 2, '2009-09-25 23:03:40', 1, 1)
---
  def create
    @inventory = Inventory.new(params[:inventory])

    respond_to do |format|
      if @inventory.save