app/controllers/orders_controller.rb

SELECT * FROM "orders"
SELECT * FROM "customers"
---
  def index
    @orders = Order.all
    @customers = Customer.all

SELECT max("orders".bill_no) AS max_bill_no FROM "orders"
SELECT * FROM "customers"
---
  def new
    @order = Order.new
    @last_bill_no = Order.maximum("bill_no")
    @customers = Customer.all