app/controllers/products_controller.rb

SELECT * FROM "products"
SELECT * FROM "categories"
---
  def index
    @products = Product.all
    @categories = Category.all

SELECT * FROM "products" WHERE ("products"."id" = 1)
SELECT * FROM "categories"
---
  def show
    @product = Product.find(params[:id])
    @categories = Category.all

SELECT * FROM "categories"
---
  def new
    @product = Product.new
    @categories = Category.all

SELECT * FROM "products" WHERE ("products"."id" = 1)
SELECT * FROM "categories"
---
  def edit
    @product = Product.find(params[:id])
    @categories = Category.all

INSERT INTO "products" ("name", "remarks", "created_at", "dimensions", "updated_at", "category_id", "description") VALUES('Beaker', '', '2009-09-24 13:22:33', '', '2009-09-24 13:22:33', 1, '')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save