app/controllers/product_lists_controller.rb

SELECT * FROM "product_lists"
SELECT * FROM "products"
SELECT * FROM "brands"
---
  def index
    @product_lists = ProductList.all
    @product_ids = Product.all
    @brand_ids = Brand.all

SELECT * FROM "product_lists" WHERE ("product_lists"."id" = 1)
SELECT * FROM "products"
SELECT * FROM "brands"
---
  def show
    @product_list = ProductList.find(params[:id])
    @product_ids = Product.all
    @brand_ids = Brand.all

SELECT * FROM "products"
SELECT * FROM "brands"
---
  def new
    @product_list = ProductList.new
    @product_ids = Product.all
    @brand_ids = Brand.all

INSERT INTO "product_lists" ("name", "price", "created_at", "product_id", "updated_at", "brand_id") VALUES('Borosil Beaker', 200.0, '2009-09-25 21:45:45', 1, '2009-09-25 21:45:45', 1)
---
  def create
    @product_list = ProductList.new(params[:product_list])

    respond_to do |format|
      if @product_list.save

SELECT * FROM "product_lists" WHERE ("product_lists"."id" = 2)
DELETE FROM "product_lists" WHERE "id" = 2
---
  def destroy
    @product_list = ProductList.find(params[:id])
    @product_list.destroy